In [131]:
import pandas as pd
import numpy as np
import os
from statsmodels.stats.weightstats import ttest_ind
from scipy.stats import norm

In [132]:
cwd = os.getcwd()

In [133]:
df = pd.read_csv(cwd + "/data_pcv_project.csv")
df

     Company ID        Wage Wage Type  Zip Code of Residence
0             4  112,291.00    Salary                  56024
1             4   64,701.00    Salary                  56082
2             4       10.81    Hourly                  56001
3             4   53,505.00    Salary                  56024
4             4       20.48    Hourly                  56001
..          ...         ...       ...                    ...
486          33       10.52    Hourly                  97527
487          33       10.52    Hourly                  97527
488          33       10.34    Hourly                  97530
489          33       10.34    Hourly                  97544
490          33       10.49    Hourly                  97544

[491 rows x 4 columns]

The goal of this practice is to identify if there is a satatistically significant difference between the wages of jobs in rural locations vs urban locations.

In [134]:
df_mod = df.copy()

In [135]:
df_mod.dtypes

Company ID                int64
Wage                     object
Wage Type                object
Zip Code of Residence     int64
dtype: object

In [136]:
df_mod["Wage"] = df_mod["Wage"].str.replace(',', '').astype('float64')
df_mod.dtypes

Company ID                 int64
Wage                     float64
Wage Type                 object
Zip Code of Residence      int64
dtype: object

In [137]:
df_mod

     Company ID       Wage Wage Type  Zip Code of Residence
0             4  112291.00    Salary                  56024
1             4   64701.00    Salary                  56082
2             4      10.81    Hourly                  56001
3             4   53505.00    Salary                  56024
4             4      20.48    Hourly                  56001
..          ...        ...       ...                    ...
486          33      10.52    Hourly                  97527
487          33      10.52    Hourly                  97527
488          33      10.34    Hourly                  97530
489          33      10.34    Hourly                  97544
490          33      10.49    Hourly                  97544

[491 rows x 4 columns]

We are bringing in census data from 2010 because it contains something called a MEMI (Metropolitan/Micropolitan Statistical Status Indicator)<br>
1 = micropolitan<br>
2 = metropolitan

We need this as a way to identify certain zip codes as rural/urban.

In [138]:
census = pd.read_csv(cwd + "/zcta_county_rel_census_2010.csv")
census

       ZCTA5  MEMI   CBSA  POPPT  ...  MPOPPCT  MHUPCT  MAREAPCT  MAREALANDPCT
0        601     2  10260  18465  ...    94.77   94.71     95.03         95.14
1        601     2  46580    105  ...     0.32    0.35      0.78          0.79
2        602     1  10380  41520  ...    13.56   13.02      6.52          8.54
3        603     1  10380  54689  ...    17.86   18.47      6.39          8.82
4        606     1  41900     89  ...     0.06    0.05      0.70          1.17
...      ...   ...    ...    ...  ...      ...     ...       ...           ...
28707  99760     1  21820     28  ...     0.03    0.07      0.75          0.76
28708  99775     1  21820   1251  ...     1.28    0.40      0.00          0.00
28709  99801     2  27940  29164  ...    93.25   91.90     76.74         81.18
28710  99824     2  27940   2111  ...     6.75    8.04      0.07          0.06
28711  99901     2  28540  13475  ...    99.99   99.90     76.14         93.32

[28712 rows x 23 columns]

In [139]:
census_mod = census.copy()

In [140]:
census_mod = census_mod[["ZCTA5", "MEMI"]]
census_mod = census_mod.drop_duplicates(subset = "ZCTA5")
census_mod

       ZCTA5  MEMI
0        601     2
2        602     1
3        603     1
4        606     1
6        610     1
...      ...   ...
28707  99760     1
28708  99775     1
28709  99801     2
28710  99824     2
28711  99901     2

[25659 rows x 2 columns]

In [141]:
df_w_census = pd.merge(left = df_mod,
                right = census_mod,
                how = "left",
                left_on = "Zip Code of Residence",
                right_on = "ZCTA5")
print("Original Data:", len(df_mod))
print("Merged Data:", len(df_w_census))
df_w_census = df_w_census.drop(columns = "ZCTA5")
df_w_census = df_w_census[df_w_census["MEMI"].notna()]
print("Data After Drop:", len(df_w_census))
df_w_census["MEMI"] = df_w_census["MEMI"].astype('int64')

Original Data: 491
Merged Data: 491
Data After Drop: 434

In [142]:
df_w_census.dtypes

Company ID                 int64
Wage                     float64
Wage Type                 object
Zip Code of Residence      int64
MEMI                       int64
dtype: object

In [143]:
df_w_census.columns = df_w_census.columns.str.lower()
df_w_census.drop(columns = ['company id', 'zip code of residence'])
df_w_census.rename(columns = {
    'wage type' : 'type'
}, inplace= True)

After this we have successfully completed data tidying and can now begin the analysis.

In [144]:
df_w_census.groupby("type")["wage"].describe()

        count          mean           std  ...       50%        75%        max
type                                       ...
Hourly  187.0     14.211818      3.635265  ...     13.18      15.72      29.91
Salary  247.0  88929.719798  45576.261630  ...  75878.00  109477.00  340894.00

[2 rows x 8 columns]

Since we are working with data that is classified in two different ways, i.e. hourly wages and salary wages, let's split the data into two dataframes and perform the analysis seperately.

In [145]:
hourly = df_w_census["type"] == "Hourly"
df_hourly = df_w_census[hourly]
salary = df_w_census["type"] == "Salary"
df_salary = df_w_census[salary]

In [146]:
df_hourly.groupby("memi")["wage"].describe()

      count       mean       std   min      25%     50%      75%    max
memi
1     103.0  14.149709  3.906003  9.99  10.9450  13.410  15.5250  29.91
2      84.0  14.287976  3.294638  9.98  11.8475  13.105  15.9325  24.44

In [147]:
df_salary.groupby("memi")["wage"].describe()

      count          mean           std  ...      50%       75%       max
memi                                     ...
1     227.0  90105.569559  46324.593685  ...  76254.0  110173.5  340894.0
2      20.0  75583.825000  34124.575602  ...  67083.5   92123.0  177819.0

[2 rows x 8 columns]

There are hardly any metropolitan salaried data points. We could compare with a t-test, since the sample size is so small that we cannot assume normal data, but it appears to me that the data collection may have been biased towards rural areas in the salaried data.

Let's perform a pooled variance t-test on the hourly wages.

In [150]:
hourly_micro = df_hourly["memi"] == 1
hourly_metro = df_hourly["memi"] == 2
x1 = df_hourly[hourly_micro]["wage"]
x2 = df_hourly[hourly_metro]["wage"]



ttest_ind(x1, x2, value = 0, alternative = 'two-sided')

(-0.25806483833971516, 0.7966437248577758, 185.0)

There is approximately an 80% chance of getting a value at or more extreme than the observed statistic under the assumption that the samples come from the same distribution. With this result, we accept the null that the means of the two populations are the same.